src/test/resources/jmeter/testJMeter.yaml
modules:
  jmeter:
    path: ${JMETER_PATH}/${JMETER_VERSION}
    version: ${JMETER_VERSION}
    properties:
      log_level: DEBUG
      user.classpath: lib
  console:
    disable: true

execution:
- concurrency: 1
  scenario:
    script: RTESampler3270.jmx
  iterations : 3
- concurrency: 1
  scenario:
    script: RTESampler5250.jmx
  iterations: 3

reporting:
- module: passfail
  criteria:
  - failures>0%